---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidSketchForRoofsoffit
source: html/4480108d-f10d-17c9-a0a6-b2cc80e910d6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidSketchForRoofsoffit Property

Roof Soffit sketch is invalid.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidSketchForRoofsoffit { get; }
```